<?xml version="1.0"?>
<net name="main_graph" version="11">
	<layers>
		<layer id="1" name="input1" type="Parameter" version="opset1">
			<data shape="1,3,576,320" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="input1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>576</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="0" name="input2" type="Parameter" version="opset1">
			<data shape="1,3,576,320" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="input2">
					<dim>1</dim>
					<dim>3</dim>
					<dim>576</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Constant_43451_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1, 1" offset="0" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Constant_43451" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Constant_43450_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1, 1" offset="0" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Constant_43450" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Constant_41242_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 3, 1, 1" offset="2" size="6" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Constant_41242" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Multiply_41237" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>576</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>576</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Constant_41239_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 3, 1, 1" offset="8" size="6" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Constant_41239" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="/Div_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>576</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/Div_1_output_0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>576</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Constant_41249_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 3, 1, 1" offset="2" size="6" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Constant_41249" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Multiply_41244" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>576</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>576</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Constant_41246_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 3, 1, 1" offset="8" size="6" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Constant_41246" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="/Div_3" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>576</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/Div_3_output_0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>576</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="/Concat" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>576</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>576</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/Concat_output_0">
					<dim>2</dim>
					<dim>3</dim>
					<dim>576</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="backbone.conv1.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="64, 3, 7, 7" offset="14" size="18816" />
			<output>
				<port id="0" precision="FP16" names="backbone.conv1.weight">
					<dim>64</dim>
					<dim>3</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="backbone.conv1.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>3</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>3</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="/backbone/conv1/Conv" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="3, 3" pads_end="3, 3" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>3</dim>
					<dim>576</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>3</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/conv1/Conv_output_0">
					<dim>2</dim>
					<dim>64</dim>
					<dim>288</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Constant_174" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="18830" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="MVN_175" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>64</dim>
					<dim>288</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/norm1/InstanceNormalization_output_0">
					<dim>2</dim>
					<dim>64</dim>
					<dim>288</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="/backbone/relu1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>64</dim>
					<dim>288</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/relu1/Relu_output_0">
					<dim>2</dim>
					<dim>64</dim>
					<dim>288</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="backbone.layer1.0.conv1.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="64, 64, 3, 3" offset="18846" size="73728" />
			<output>
				<port id="0" precision="FP16" names="backbone.layer1.0.conv1.weight">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="backbone.layer1.0.conv1.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="/backbone/layer1/layer1.0/conv1/Conv" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>64</dim>
					<dim>288</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/layer1/layer1.0/conv1/Conv_output_0">
					<dim>2</dim>
					<dim>64</dim>
					<dim>288</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Constant_209" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="18830" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="MVN_210" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>64</dim>
					<dim>288</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/layer1/layer1.0/norm1/InstanceNormalization_output_0">
					<dim>2</dim>
					<dim>64</dim>
					<dim>288</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="/backbone/layer1/layer1.0/relu/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>64</dim>
					<dim>288</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/layer1/layer1.0/relu/Relu_output_0">
					<dim>2</dim>
					<dim>64</dim>
					<dim>288</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="backbone.layer1.0.conv2.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="64, 64, 3, 3" offset="92574" size="73728" />
			<output>
				<port id="0" precision="FP16" names="backbone.layer1.0.conv2.weight">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="backbone.layer1.0.conv2.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="/backbone/layer1/layer1.0/conv2/Conv" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>64</dim>
					<dim>288</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/layer1/layer1.0/conv2/Conv_output_0">
					<dim>2</dim>
					<dim>64</dim>
					<dim>288</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Constant_244" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="18830" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="MVN_245" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>64</dim>
					<dim>288</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/layer1/layer1.0/norm2/InstanceNormalization_output_0">
					<dim>2</dim>
					<dim>64</dim>
					<dim>288</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="/backbone/layer1/layer1.0/relu_1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>64</dim>
					<dim>288</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/layer1/layer1.0/relu_1/Relu_output_0">
					<dim>2</dim>
					<dim>64</dim>
					<dim>288</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="/backbone/layer1/layer1.0/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>64</dim>
					<dim>288</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>2</dim>
					<dim>64</dim>
					<dim>288</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/layer1/layer1.0/Add_output_0">
					<dim>2</dim>
					<dim>64</dim>
					<dim>288</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="/backbone/layer1/layer1.0/relu_2/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>64</dim>
					<dim>288</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/layer1/layer1.0/relu_2/Relu_output_0">
					<dim>2</dim>
					<dim>64</dim>
					<dim>288</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="backbone.layer1.1.conv1.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="64, 64, 3, 3" offset="166302" size="73728" />
			<output>
				<port id="0" precision="FP16" names="backbone.layer1.1.conv1.weight">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="backbone.layer1.1.conv1.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="/backbone/layer1/layer1.1/conv1/Conv" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>64</dim>
					<dim>288</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/layer1/layer1.1/conv1/Conv_output_0">
					<dim>2</dim>
					<dim>64</dim>
					<dim>288</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Constant_281" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="18830" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="MVN_282" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>64</dim>
					<dim>288</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/layer1/layer1.1/norm1/InstanceNormalization_output_0">
					<dim>2</dim>
					<dim>64</dim>
					<dim>288</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="/backbone/layer1/layer1.1/relu/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>64</dim>
					<dim>288</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/layer1/layer1.1/relu/Relu_output_0">
					<dim>2</dim>
					<dim>64</dim>
					<dim>288</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="backbone.layer1.1.conv2.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="64, 64, 3, 3" offset="240030" size="73728" />
			<output>
				<port id="0" precision="FP16" names="backbone.layer1.1.conv2.weight">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="backbone.layer1.1.conv2.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="/backbone/layer1/layer1.1/conv2/Conv" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>64</dim>
					<dim>288</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/layer1/layer1.1/conv2/Conv_output_0">
					<dim>2</dim>
					<dim>64</dim>
					<dim>288</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Constant_316" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="18830" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="MVN_317" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>64</dim>
					<dim>288</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/layer1/layer1.1/norm2/InstanceNormalization_output_0">
					<dim>2</dim>
					<dim>64</dim>
					<dim>288</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="/backbone/layer1/layer1.1/relu_1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>64</dim>
					<dim>288</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/layer1/layer1.1/relu_1/Relu_output_0">
					<dim>2</dim>
					<dim>64</dim>
					<dim>288</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="/backbone/layer1/layer1.1/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>64</dim>
					<dim>288</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>2</dim>
					<dim>64</dim>
					<dim>288</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/layer1/layer1.1/Add_output_0">
					<dim>2</dim>
					<dim>64</dim>
					<dim>288</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="/backbone/layer1/layer1.1/relu_2/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>64</dim>
					<dim>288</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/layer1/layer1.1/relu_2/Relu_output_0">
					<dim>2</dim>
					<dim>64</dim>
					<dim>288</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="backbone.layer2.0.downsample.0.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="96, 64, 1, 1" offset="313758" size="12288" />
			<output>
				<port id="0" precision="FP16" names="backbone.layer2.0.downsample.0.weight">
					<dim>96</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="backbone.layer2.0.downsample.0.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>96</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="/backbone/layer2/layer2.0/downsample/downsample.0/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>64</dim>
					<dim>288</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>96</dim>
					<dim>144</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Reshape_431_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 96, 1, 1" offset="326046" size="192" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Reshape_431" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="/backbone/layer2/layer2.0/downsample/downsample.0/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>96</dim>
					<dim>144</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/layer2/layer2.0/downsample/downsample.0/Conv_output_0">
					<dim>2</dim>
					<dim>96</dim>
					<dim>144</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Constant_437" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="18830" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="MVN_438" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>96</dim>
					<dim>144</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/layer2/layer2.0/downsample/norm3/InstanceNormalization_output_0">
					<dim>2</dim>
					<dim>96</dim>
					<dim>144</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="backbone.layer2.0.conv1.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="96, 64, 3, 3" offset="326238" size="110592" />
			<output>
				<port id="0" precision="FP16" names="backbone.layer2.0.conv1.weight">
					<dim>96</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="backbone.layer2.0.conv1.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>96</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="/backbone/layer2/layer2.0/conv1/Conv" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>64</dim>
					<dim>288</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/layer2/layer2.0/conv1/Conv_output_0">
					<dim>2</dim>
					<dim>96</dim>
					<dim>144</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Constant_353" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="18830" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="MVN_354" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>96</dim>
					<dim>144</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/layer2/layer2.0/norm1/InstanceNormalization_output_0">
					<dim>2</dim>
					<dim>96</dim>
					<dim>144</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="/backbone/layer2/layer2.0/relu/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>96</dim>
					<dim>144</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/layer2/layer2.0/relu/Relu_output_0">
					<dim>2</dim>
					<dim>96</dim>
					<dim>144</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="backbone.layer2.0.conv2.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="96, 96, 3, 3" offset="436830" size="165888" />
			<output>
				<port id="0" precision="FP16" names="backbone.layer2.0.conv2.weight">
					<dim>96</dim>
					<dim>96</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="backbone.layer2.0.conv2.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>96</dim>
					<dim>96</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>96</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="/backbone/layer2/layer2.0/conv2/Conv" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>96</dim>
					<dim>144</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>96</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/layer2/layer2.0/conv2/Conv_output_0">
					<dim>2</dim>
					<dim>96</dim>
					<dim>144</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Constant_388" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="18830" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="MVN_389" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>96</dim>
					<dim>144</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/layer2/layer2.0/norm2/InstanceNormalization_output_0">
					<dim>2</dim>
					<dim>96</dim>
					<dim>144</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="/backbone/layer2/layer2.0/relu_1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>96</dim>
					<dim>144</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/layer2/layer2.0/relu_1/Relu_output_0">
					<dim>2</dim>
					<dim>96</dim>
					<dim>144</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="/backbone/layer2/layer2.0/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>96</dim>
					<dim>144</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>2</dim>
					<dim>96</dim>
					<dim>144</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/layer2/layer2.0/Add_output_0">
					<dim>2</dim>
					<dim>96</dim>
					<dim>144</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="/backbone/layer2/layer2.0/relu_2/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>96</dim>
					<dim>144</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/layer2/layer2.0/relu_2/Relu_output_0">
					<dim>2</dim>
					<dim>96</dim>
					<dim>144</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="backbone.layer2.1.conv1.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="96, 96, 3, 3" offset="602718" size="165888" />
			<output>
				<port id="0" precision="FP16" names="backbone.layer2.1.conv1.weight">
					<dim>96</dim>
					<dim>96</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="backbone.layer2.1.conv1.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>96</dim>
					<dim>96</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>96</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="/backbone/layer2/layer2.1/conv1/Conv" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>96</dim>
					<dim>144</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>96</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/layer2/layer2.1/conv1/Conv_output_0">
					<dim>2</dim>
					<dim>96</dim>
					<dim>144</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Constant_473" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="18830" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="MVN_474" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>96</dim>
					<dim>144</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/layer2/layer2.1/norm1/InstanceNormalization_output_0">
					<dim>2</dim>
					<dim>96</dim>
					<dim>144</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="/backbone/layer2/layer2.1/relu/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>96</dim>
					<dim>144</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/layer2/layer2.1/relu/Relu_output_0">
					<dim>2</dim>
					<dim>96</dim>
					<dim>144</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="backbone.layer2.1.conv2.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="96, 96, 3, 3" offset="768606" size="165888" />
			<output>
				<port id="0" precision="FP16" names="backbone.layer2.1.conv2.weight">
					<dim>96</dim>
					<dim>96</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="backbone.layer2.1.conv2.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>96</dim>
					<dim>96</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>96</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="/backbone/layer2/layer2.1/conv2/Conv" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>96</dim>
					<dim>144</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>96</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/layer2/layer2.1/conv2/Conv_output_0">
					<dim>2</dim>
					<dim>96</dim>
					<dim>144</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Constant_508" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="18830" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="MVN_509" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>96</dim>
					<dim>144</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/layer2/layer2.1/norm2/InstanceNormalization_output_0">
					<dim>2</dim>
					<dim>96</dim>
					<dim>144</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="/backbone/layer2/layer2.1/relu_1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>96</dim>
					<dim>144</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/layer2/layer2.1/relu_1/Relu_output_0">
					<dim>2</dim>
					<dim>96</dim>
					<dim>144</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="/backbone/layer2/layer2.1/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>96</dim>
					<dim>144</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>2</dim>
					<dim>96</dim>
					<dim>144</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/layer2/layer2.1/Add_output_0">
					<dim>2</dim>
					<dim>96</dim>
					<dim>144</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="/backbone/layer2/layer2.1/relu_2/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>96</dim>
					<dim>144</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/layer2/layer2.1/relu_2/Relu_output_0">
					<dim>2</dim>
					<dim>96</dim>
					<dim>144</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="backbone.layer3.0.downsample.0.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="128, 96, 1, 1" offset="934494" size="24576" />
			<output>
				<port id="0" precision="FP16" names="backbone.layer3.0.downsample.0.weight">
					<dim>128</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="backbone.layer3.0.downsample.0.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="/backbone/layer3/layer3.0/downsample/downsample.0/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>96</dim>
					<dim>144</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>128</dim>
					<dim>144</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Reshape_623_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128, 1, 1" offset="959070" size="256" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Reshape_623" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="/backbone/layer3/layer3.0/downsample/downsample.0/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>128</dim>
					<dim>144</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/layer3/layer3.0/downsample/downsample.0/Conv_output_0">
					<dim>2</dim>
					<dim>128</dim>
					<dim>144</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Constant_629" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="18830" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="MVN_630" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>128</dim>
					<dim>144</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/layer3/layer3.0/downsample/norm3/InstanceNormalization_output_0">
					<dim>2</dim>
					<dim>128</dim>
					<dim>144</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="backbone.layer3.0.conv1.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="128, 96, 3, 3" offset="959326" size="221184" />
			<output>
				<port id="0" precision="FP16" names="backbone.layer3.0.conv1.weight">
					<dim>128</dim>
					<dim>96</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="backbone.layer3.0.conv1.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>96</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>96</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="/backbone/layer3/layer3.0/conv1/Conv" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>96</dim>
					<dim>144</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>96</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/layer3/layer3.0/conv1/Conv_output_0">
					<dim>2</dim>
					<dim>128</dim>
					<dim>144</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Constant_545" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="18830" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="MVN_546" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>128</dim>
					<dim>144</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/layer3/layer3.0/norm1/InstanceNormalization_output_0">
					<dim>2</dim>
					<dim>128</dim>
					<dim>144</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="/backbone/layer3/layer3.0/relu/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>128</dim>
					<dim>144</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/layer3/layer3.0/relu/Relu_output_0">
					<dim>2</dim>
					<dim>128</dim>
					<dim>144</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="backbone.layer3.0.conv2.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="128, 128, 3, 3" offset="1180510" size="294912" />
			<output>
				<port id="0" precision="FP16" names="backbone.layer3.0.conv2.weight">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="backbone.layer3.0.conv2.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="/backbone/layer3/layer3.0/conv2/Conv" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>128</dim>
					<dim>144</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/layer3/layer3.0/conv2/Conv_output_0">
					<dim>2</dim>
					<dim>128</dim>
					<dim>144</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Constant_580" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="18830" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="MVN_581" type="MVN" version="opset6">
